         CLIPS (V6.21 06/15/03)
CLIPS> (deftemplate personal-data
(slot name)
(slot age)
(slot weight)
(slot smoker)
(multislot date-of-birth)
)
CLIPS> (deffacts people
(personal-data (name adam)(weight 60)(age 30)(smoker no)(date-of-birth 18 06 1970))
(personal-data (name brenda)(weight 120)(age 45)(smoker yes)(date-of-birth 18 06 1955))
(personal-data (name charles)(weight 120)(age 60)(smoker yes)(date-of-birth 18 06 1940))
)
CLIPS> (deffacts data
(date 26 04 2007)
)
CLIPS> (defrule cardiac-risk
(personal-data (name ?name)(smoker yes)(weight ?weight))
(test (> ?weight 100))
=>
(assert (cardiac-risk ?name))
)
CLIPS> (clear)
CLIPS> (defrule cardiac-risk
(logical (personal-data (name ?name)(smoker yes)(weight ?weight)))
(logical (test (> ?weight 100)))
=>
(assert (cardiac-risk ?name))
)

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for defrule.

ERROR:
(defrule MAIN::cardiac-risk
   (logical
        (personal-data (
CLIPS> (deftemplate personal-data
(slot name)
(slot age)
(slot weight)
(slot smoker)
(multislot date-of-birth)
)
CLIPS> (deffacts people
(personal-data (name adam)(weight 60)(age 30)(smoker no)(date-of-birth 18 06 1970))
(personal-data (name brenda)(weight 120)(age 45)(smoker yes)(date-of-birth 18 06 1955))
(personal-data (name charles)(weight 120)(age 60)(smoker yes)(date-of-birth 18 06 1940))
)
CLIPS> (deffacts data
(date 26 04 2007)
)
CLIPS> (defrule cardiac-risk
(personal-data (name ?name)(smoker yes)(weight ?weight))
(test (> ?weight 100))
=>
(assert (cardiac-risk ?name))
)
CLIPS> (reset)
CLIPS> (defrule cardiac-risk
(logical (personal-data (name ?name)(smoker yes)(weight ?weight)))
(logical (test (> ?weight 100)))
=>
(assert (cardiac-risk ?name))
)
CLIPS> (cardiac-risk brenda)

[EXPRNPSR3] Missing function declaration for cardiac-risk.
CLIPS> (run)
CLIPS> (cardiac-risk brenda)

[EXPRNPSR3] Missing function declaration for cardiac-risk.
CLIPS> (modify 2 (weight 80))
<Fact-7>
CLIPS> (defrule poke-fun-at-smokers
(personal-data (name ?name)(smoker yes))
=>
(printout t ?name "is a fool. " crlf)
)
CLIPS> (defrule worry-about-thin-people
(perosnal-data (name ?name)(weight ?weight))
(test (< ?weight 80))
=>
(printout t ?name " is looking a bit thin. " crlf))

[PRNTUTIL2] Syntax Error:  Check appropriate syntax for defrule.

ERROR:
(defrule MAIN::worry-about-thin-people
   (perosnal-data (
CLIPS> (defrule worry-about-thin-people
(personal-data (name ?name)(weight ?weight))
(test (< ?weight 80))
=>
(printout t ?name " is looking a bit thin." crlf))
CLIPS> (defrule poke-fun-at-smokers
(declare (salience 10))
(personal-data (name ?name)(smoker yes))
=>
(printout t ?name "is a fool." crlf))
CLIPS> (defrule worry-about-thin-people
(declare (salience 20))
(personal-data (name ?name)(weight ?weight))
(test (< ?weight 80))
=>
(printout t ?name "is looking a bit thin." crlf))
CLIPS> 
